

import UIKit
import Foundation

//4. Напишете програма, която за дадена цифра (0-9), зададена като вход, извежда името на цифрата на български език.

//8.    Напишете програма, която прилага бонус точки към дадени точки в интервала [1..9] чрез прилагане на следните правила:
//-     Ако точките са между 1 и 3, програмата ги умножава по 10.
//-     Ако точките са между 4 и 6, ги умножава по 100.
//-     Ако точките са между 7 и 9, ги умножава по 1000.
//-     Ако точките са 0 или повече от 9, се отпечатва съобщение за грешка.
//
//9.    Напишете програма, която преобразува дадено число в интервала [0..999] в текст, съответстващ на българското произношение. Примери:
//-     0  "Нула"
//-     273  "Двеста седемдесет и три"
//-     400  "Четиристотин"
//-     501  "Петстотин и едно"
//-     711  "Седемстотин и единадесет"
//
//
//Цикли - for, while….
//2.    Напишете програма, която отпечатва на конзолата числата от 1 до N, които не се делят на 3 и 7. Числото N се взима чрез входен параметър на функцията.
//
//
//Масиви
//1.    Да се напише програма, която създава масив с 20 елемента от целочислен тип и инициализира всеки от елементите със стойност равна на индекса на елемента умножен по 5. Елементите на масива да се изведат на конзолата.
//
//2.    Да се напише програма, която чете два масива от конзолата и прове­рява дали са еднакви.
//
//4.    Напишете програма, която намира максималната редица от еднакви елементи в масив. Пример: {2, 1, 1, 2, 3, 3, 2, 2, 2, 1} -> {2, 2, 2}.
//5.    Напишете програма, която намира максималната редица от нараст­ващи елементи в масив. Пример: {3, 2, 3, 4, 2, 2, 4} -> {2, 3, 4}.
//7.    Сортиране на масив означава да подредим елементите му в нарастващ (намаляващ) ред. Напишете програма, която сортира масив. Да се използва алгоритъма "Selection sort".
//
//12.  Да се напише програма, която създава масив с всички букви от латинската азбука. Да се даде възможност на потребител да въвежда дума от конзолата и в резултат да се извеждат индексите на буквите от думата.
//
//15.  Напишете програма, която сортира целочислен масив по алгоритъма "quick sort".
//
//Дефиниране на класове
//1.  Дефинирайте клас Student, който съдържа следната информация за студентите: трите имена, курс, специалност, университет, електронна поща и телефонен номер.
//2.   Декларирайте няколко конструктора за класа Student, които имат различни списъци с параметри (за цялостната информация за даден студент или част от нея). Данните, за които няма входна информация да се инициализират съответно с null или 0.
//3.   Добавете статично поле в класа Student, в което се съхранява броя на създадените обекти от този клас.
//4.    Добавете метод в класа Student, който извежда пълна информация за студента.
//5.  Модифицирайте текущия код на класа Student така, че да капсулирате данните в класа (Да няма директен достъп до пропъртитата на класа от друг клас).
//6.    Създайте клас StudentTest, в който ще се тества функционалността на класа Student.
//7.    Добавете статичен метод в класа StudentTest, който създава няколко обекта от тип Student и ги съхранява в статични полета. Създайте статично свойство на класа, което да ги достъпва. Напишете тестова програма, която да извежда информацията за тях в конзолата.
//8.    Дефинирайте клас, който съдържа информация за мобилен телефон: модел, производител, цена, собственик, характеристики на батерията (модел, idle time и часове разговор /hours talk/) и характеристики на екрана (големина и цветове).
//9.    Декларирайте няколко конструктора за всеки от създадените класове от предходната задача, които имат различни списъци с параметри (за цялостната информация за даден студент или част от нея). Данните за полетата, които не са известни трябва да се инициализират съответно със стойности с null или 0.
//10. Към класа за мобилен телефон от предходните две задачи, добавете статично поле nokiaN95, което да съхранява информация за мобилен телефон модел Nokia 95. Добавете метод, в същия клас, който извежда информация за това статично поле.
//11. Дефинирайте свойства, за да капсулирате данните в класовете GSM, Battery и Display.
//12. Напишете клас GSMTest, който тества функционалностите на класа GSM. Създайте няколко обекта от дадения клас и ги запазете в масив. Изведете информация за създадените обекти. Изведете информация за статичното полеnokiaN95.
//13. Създайте клас Call, който съдържа информация за разговор, осъщес­твен през мобилен телефон. Той трябва да съдържа информация за датата, времето на започване и продължителността на разговора.
//14. Добавете свойство архив с обажданията – callHistory, което да пази списък от осъщест­вените разговори.
//15. В класа GSM добавете методи за добавяне и изтриване на обаждания (Call) в архива с обаждания на мобилния телефон. Добавете метод, който изтрива всички обаждания от архива.
//16. В класа GSM добавете метод, който пресмята общата сума на обажда­нията (Call) от архива с обаждания на телефона (callHistory) като нека цената за едно обаждане се подава като параметър на метода.
//17. Създайте клас GSMCallHistoryTest,  с който да се тества функционал­ността на класа GSM, от задача 12, като обект от тип GSM. След това, към него добавете няколко обаждания (Call). Изведете информация за всяко едно от обажданията. Ако допуснем, че цената за минута раз­говор е 0.37, пресметнете и отпечатайте общата цена на разговорите. Премахнете най-дългият разговор от архива с обаждания и пресмет­нете общата цена за всички разговори отново. Най-накрая изтрийте архива с обаждания.
//18. Нека е дадена библиотека с книги. Дефинирайте класове съответно за библиотека и книга. Библиотеката трябва да съдържа име и списък от книги. Книгите трябва да съдържат информация за заглавие, автор, издателство, година на издаване и ISBN-номер. В класа, който описва библиотека, добавете методи за добавяне на книга към библиотеката, търсене на книга по предварително зададен автор, извеждане на информация за дадена книга и изтриване на книга от библиотеката.
//19. Напишете тестов клас, който създава обект от тип библиотека, добавя няколко книги към него и извежда информация за всяка една от тях. Имплементирайте тестова функционалност, която намира всички книги, чийто автор е Стивън Кинг и ги изтрива. Накрая, отново изведете информация за всяка една от оставащите книги.
//20. Дадено ни е училище. В училището имаме класове и ученици. Всеки клас има множество от преподаватели. Всеки преподавател има мно­жест­во от дисциплини, по които преподава. Учениците имат име и уникален номер в класа. Класовете имат уникален текстов иден­тификатор. Дисциплините имат име, брой уроци и брой упражне­ния.
//Задачата е да се моделира училище с Swift класове. Трябва да декларирате класове заедно с техните полета, свойства, методи и конструктори. Дефинирайте и тестов клас, който демонстрира, че останалите класове работят коректно.


/////////////////////////////////////////////////////////////////////////////////////////////////////////////





























//4. Напишете програма, която за дадена цифра (0-9), зададена като вход, извежда името на цифрата на български език.


//var number: Int!
//    
//    number = 0
//    switch number {
//        
//    case 0:
//        print("нула")
//    case 1:
//        print("едно")
//    case 2:
//        print("две")
//    case 3:
//        print("три")
//    case 4:
//        print("четири")
//    case 5:
//        print("пет")
//    case 6:
//        print("шест")
//    case 7:
//        print("седем")
//    case 8:
//        print("осем")
//    case 9:
//        print("девет")
//        
//    default:
//        print("Няма въведено число")
//    }



////////////////////////////////////////////////////////////////////////////////////////////////////////////


//8.    Напишете програма, която прилага бонус точки към дадени точки в интервала [1..9] чрез прилагане на следните правила:
//-     Ако точките са между 1 и 3, програмата ги умножава по 10.
//-     Ако точките са между 4 и 6, ги умножава по 100.
//-     Ако точките са между 7 и 9, ги умножава по 1000.
//-     Ако точките са 0 или повече от 9, се отпечатва съобщение за грешка.

//var number: Int!
//number = 1
//
//if number == 0 || number > 9 {
//    print("error")
//}
//else if number <= 3 {
//    print(number * 10)
//} else if number <= 6 {
//    print(number * 100)
//} else if number <= 9 {
//    print(number * 1000)
//} else {
//    print("Please type correct number")
//}


/////////////////////////////////////////////////////////////////////////////////////////////////////////////


//9.    Напишете програма, която преобразува дадено число в интервала [0..999] в текст, съответстващ на българското произношение. Примери:
//-     0  "Нула"
//-     273  "Двеста седемдесет и три"
//-     400  "Четиристотин"
//-     501  "Петстотин и едно"
//-     711  "Седемстотин и единадесет"
//
//var num = 809
//
//var a = num / 100
//var b = num / 10 % 10
//var c = num % 10
//
//if a >= 1 {
//    
//    switch a {
//        
//    case 1:
//        print("Сто")
//    case 2:
//        print("Двеста")
//    case 3:
//        print("Триста")
//    case 4:
//        print("Четеристотин")
//    case 5:
//        print("Петстотин")
//    case 6:
//        print("Шестстотин")
//    case 7:
//        print("Седемстотин")
//    case 8:
//        print("Осемстотин")
//    case 9:
//        print("Деветстотин")
//    default:
//        print("Некоректно въведени данни...")
//    }
//    if ( (b <= 1) && (c != 0) ) {
//        print("и ")
//    }
//    
//    if (b>1) {
//        switch b {
//        case 2:
//            print("двадесет ")
//        case 3:
//            print("тридесет ")
//        case 4:
//            print("четиридесет ")
//        case 5:
//            print("петдесет ")
//        case 6:
//            print("шестдесет ")
//        case 7:
//            print("седемдесет ")
//        case 8:
//            print("осемдесет ")
//        case 9:
//            print("деветдесет ")
//            
//        default:
//            print("error")
//        }
//        if ( (b != 0) && (c != 0) ) {
//            print("и ");
//        }
//    }
//    if ( (b != 1) && (c != 0) ){
//        switch c {
//        case 1:
//            print("eдно")
//        case 2:
//            print("две")
//        case 3:
//            print("три")
//        case 4:
//            print("четири")
//        case 5:
//            print("пет")
//        case 6:
//            print("шест")
//        case 7:
//            print("седем")
//        case 8:
//            print("осем")
//        case 9:
//            print("девет")
//            
//            default:
//            print("errrror")
//        }
//    }
//    if (b == 1) {
//        switch c {
//        case 0:
//            print("десет")
//        case 1:
//            print("единадесет")
//        case 2:
//            print("дванадесет")
//        case 3:
//            print("тринадесет")
//        case 4:
//            print("четиринадесет")
//        case 5:
//            print("петнадесет")
//        case 6:
//            print("шестнадесет")
//        case 7:
//            print("седемнадесет")
//        case 8:
//            print("осемнадесет")
//        case 9:
//            print("деветнадесет")
//            
//        default:
//            print("error")
//        }
//    }
//    if ( (a==0) && (b==0) && (c==0)) {
//        print("Нула")
//    }
//}


//let digits = [0: "нула", 1: "едно", 2: "две", 3: "три", 4: "четири", 5: "пет", 6: "шест", 7: "седем", 8: "осем", 9: "девет"]
//let numbers = [10: "десет", 11: "единадесет",12: "дванадесет", 13: "тринадесет", 14: "четиринадесет", 15: "петнадесет", 16: "шестнадесет", 17: "седемнадесет", 18: "осемнадесет", 19: "деветнадесет"]
//
//let someNumbers = [16, 12, 19]
//
//let strings = someNumbers.map {
//
//    (number) -> String in
//    
//    var number = number
//    
//    var output = ""
//    
////    if (number % 10 == 0) {}
//    
//    repeat {
//        
//        output = digits[number % 10]! + output
//        
//        number /= 10
//    } while number > 0
//    return output
//}
//
//print(strings)


/////////////////////////////////////////////////////////////////////////////////////////////////////////////



//Цикли - for, while….
//2.    Напишете програма, която отпечатва на конзолата числата от 1 до N, които не се делят на 3 и 7. Числото N се взима чрез входен параметър на функцията.

//func fromOneToN(n: Int) {
//    
//    for number in 1...n {
//        if (number % 3 != 0) && (number % 7 != 0) {
//            print(number)
//        }
//    }
//}
//
//fromOneToN(n: 100)


/////////////////////////////////////////////////////////////////////////////////////////////////////////////


//Масиви
//1.    Да се напише програма, която създава масив с 20 елемента от целочислен тип и инициализира всеки от елементите със стойност равна на индекса на елемента умножен по 5. Елементите на масива да се изведат на конзолата.


//var intArray = [Int]()
//for i in 1...20 {
//    intArray.append(i * 5)
//}
//print(intArray)

/////////////////////////////////////////////////////////////////////////////////////////////////////////////


//2.    Да се напише програма, която чете два масива от конзолата и прове­рява дали са еднакви.

//var intArray1 = [Int]()
//var intArray2 = [Int]()
//
//intArray1.append(1)
//intArray2.append(3)
//
//if intArray1 == intArray2 {
//    print("The arrays are equal")
//} else {
//    print("The arrays are not equal")
//}


/////////////////////////////////////////////////////////////////////////////////////////////////////////////

//4.    Напишете програма, която намира максималната редица от еднакви елементи в масив. Пример: {2, 1, 1, 2, 3, 3, 2, 2, 2, 1} -> {2, 2, 2}.


/////////////////////////////////////////////////////////////////////////////////////////////////////////////


//5.    Напишете програма, която намира максималната редица от нараст­ващи елементи в масив. Пример: {3, 2, 3, 4, 2, 2, 4} -> {2, 3, 4}.
//let numbers = [ 1, 3, 7, 11]
//let x = 6
//let closest = numbers.enumerated().min( by: { abs($0.1 - x) < abs($1.1 - x))
//    print(closest.element) // 7
//    print(closest.offset) // 2
/////////////////////////////////////////////////////////////////////////////////////////////////////////////

//7.    Сортиране на масив означава да подредим елементите му в нарастващ (намаляващ) ред. Напишете програма, която сортира масив. Да се използва алгоритъма "Selection sort".

//var numbersArray = [Int]()
//
//for number in 1...11 {
//    numbersArray.append(number)
//}
//
//numbersArray.sort {
//    return $1 < $0
//}

/////////////////////////////////////////////////////////////////////////////////////////////////////////////

//12.  Да се напише програма, която създава масив с всички букви от латинската азбука. Да се даде възможност на потребител да въвежда дума и в резултат да се извеждат индексите на буквите от думата.


var alphabet = ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z"]

let word = "abcd"

for element in word.characters {

    print(alphabet.index(of: String(element))!)
    
}


//func getIndexFromArray() -> Int {

//    return
//}

//for i in 0..<alphabet.count {
//    print(alphabet[i])
//}

// test test
// test test
// test test
// test test

//for (index, letter) in alphabet.enumerated() {
//    print("\(index) \(letter)")
//}

/////////////////////////////////////////////////////////////////////////////////////////////////////////////
